In [1]:
import pandas as pd
import pandasql as ps

In [2]:
A = pd.DataFrame(
    data = [
        (1, 'AA'),
        (2, 'BB'),
        (3, 'CC')
    ],
    columns = ['ID', 'VAL']
)
A

   ID VAL
0   1  AA
1   2  BB
2   3  CC

In [3]:
B = pd.DataFrame(
    data = [
        (1, 'A'),
        (2, 'B'),
        (3, 'B'),
        (4, 'A')
    ],
    columns = ['ID', 'VAL']
)
B

   ID VAL
0   1   A
1   2   B
2   3   B
3   4   A

In [8]:
query = """
SELECT
    A.VAL, B.VAL
FROM A LEFT JOIN B on A.ID = B.ID AND B.VAL = 'A';
"""
ps.sqldf(query, locals())

  VAL   VAL
0  AA     A
1  BB  None
2  CC  None

In [9]:
query = """
SELECT
    A.VAL, B.VAL
FROM A LEFT JOIN B on A.ID = B.ID WHERE B.VAL = 'A';
"""
ps.sqldf(query, locals())

  VAL VAL
0  AA   A

In [10]:
query = """
SELECT
    A.VAL, B.VAL
FROM A LEFT JOIN B on A.ID = B.ID;
"""
ps.sqldf(query, locals())

  VAL VAL
0  AA   A
1  BB   B
2  CC   B